package ex01_04;

public class Ex1 {

	public static void main(String[] args) {
		/*
		 * p49
		 * Q1) 정답 : 컴파일
		 * 프로그램(코드)을 기계가 이해할 수 있는 언어로 바꾸는 작업을 000이라고 합니다.
		 * 
		 * 
		 * Q2) 정답 : 객체지향 
		 * 000 언어는 자바나 C++와 같이 대상이 되는 객체를 기반으로 프로그램을 구현하는 언어입니다.
		 * 
		 * Q3) 정답 : JVM(Java Virtual Machine)
		 * 자바로 만든 프로그램은 000이 설치되어 있으면 운영체제와 상관없이 실행할 수 있습니다.
		 * 
		 * Q4) 정답 : JDK(자바 개발 키트)
		 * 자바 개발을 위해 설치하는 자바 라이브러리를 000라고 합니다.
		 * 
		 * Q5) 정답 : JRE(Java Runtime Environment, 자바 런타임 환경)
		 * 자바 프로그램이 실행되는 자바 실행 환경을 000라고 합니다.
		 * 
		 * 
		 * */

	}

}
